app/Controllers/Usuario_controller.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $userModel = new Usuarios_model();
        $data['usuarios'] = $userModel->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'
---
    public function usuarioData()
    {
        if (!session()->get('logged_in') || session()->get('perfil_id') != 2) {
            return redirect()->to('/login');
        }

        $usuario_id = session()->get('id');
        $usuarioModel = new Usuarios_model();
        $usuario = $usuarioModel->find($usuario_id);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'
SELECT *
FROM `usuarios`
WHERE `email` = 'cliente@gmail.com'
 LIMIT 1
---
        }

        // 4. Manejar la unicidad del email (si ha cambiado)
        $currentUser = $usuarioModel->find($id); // Obtener el usuario actual para comparar el email
        if ($currentUser && $data['email'] !== $currentUser['email']) {
            $existingUserWithNewEmail = $usuarioModel->where('email', $data['email'])->first();

UPDATE `usuarios` SET `nombre` = 'cliente', `apellido` = 'ejemplo', `usuario` = 'cliente1', `email` = 'cliente@gmail.com'
WHERE `usuarios`.`id` IN ('3')
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'
---
        }

        // 5. Ejecutar la actualización en la base de datos
        if ($usuarioModel->update($id, $data)) {
            // 6. Si la actualización fue exitosa, refrescar la sesión
            $usuarioActualizado = $usuarioModel->find($id); // Volver a buscar el usuario para obtener los datos más recientes